Continued plan output from previous comment.
<details><summary>Show Output</summary>

```diff
6671795:rule/svep_delete_clinical_trigger" -> null
      - statement_id        = "CloudwatchDeleteClinicalWorkflowAllowInvoke" -> null
        # (2 unchanged attributes hidden)
    }

  # module.svep[0].aws_lambda_permission.plugin_plugin_gnomad_constraint_invoke_permission will be destroyed
  # (because aws_lambda_permission.plugin_plugin_gnomad_constraint_invoke_permission is not in configuration)
  - resource "aws_lambda_permission" "plugin_plugin_gnomad_constraint_invoke_permission" {
      - action              = "lambda:InvokeFunction" -> null
      - function_name       = "svep-backend-pluginGnomadConstraint" -> null
      - id                  = "SNSPluginGnomadAllowInvoke" -> null
      - principal           = "sns.amazonaws.com" -> null
      - source_arn          = "arn:aws:sns:ap-southeast-3:307946671795:svep-backend-pluginGnomadConstraint" -> null
      - statement_id        = "SNSPluginGnomadAllowInvoke" -> null
        # (2 unchanged attributes hidden)
    }

  # module.svep[0].aws_lambda_permission.plugin_plugin_gnomad_one_kg_invoke_permission will be destroyed
  # (because aws_lambda_permission.plugin_plugin_gnomad_one_kg_invoke_permission is not in configuration)
  - resource "aws_lambda_permission" "plugin_plugin_gnomad_one_kg_invoke_permission" {
      - action              = "lambda:InvokeFunction" -> null
      - function_name       = "svep-backend-pluginGnomadOneKG" -> null
      - id                  = "SNSPluginGnomadAllowInvoke" -> null
      - principal           = "sns.amazonaws.com" -> null
      - source_arn          = "arn:aws:sns:ap-southeast-3:307946671795:svep-backend-pluginGnomadOneKG" -> null
      - statement_id        = "SNSPluginGnomadAllowInvoke" -> null
        # (2 unchanged attributes hidden)
    }

  # module.svep[0].aws_sns_topic.pluginGnomadConstraint will be destroyed
  # (because aws_sns_topic.pluginGnomadConstraint is not in configuration)
  - resource "aws_sns_topic" "pluginGnomadConstraint" {
      - application_success_feedback_sample_rate = 0 -> null
      - arn                                      = "arn:aws:sns:ap-southeast-3:307946671795:svep-backend-pluginGnomadConstraint" -> null
      - content_based_deduplication              = false -> null
      - fifo_topic                               = false -> null
      - firehose_success_feedback_sample_rate    = 0 -> null
      - http_success_feedback_sample_rate        = 0 -> null
      - id                                       = "arn:aws:sns:ap-southeast-3:307946671795:svep-backend-pluginGnomadConstraint" -> null
      - lambda_success_feedback_sample_rate      = 0 -> null
      - name                                     = "svep-backend-pluginGnomadConstraint" -> null
      - owner                                    = "307946671795" -> null
      - policy                                   = jsonencode(
            {
              - Id        = "__default_policy_ID"
              - Statement = [
                  - {
                      - Action    = [
                          - "SNS:GetTopicAttributes",
                          - "SNS:SetTopicAttributes",
                          - "SNS:AddPermission",
                          - "SNS:RemovePermission",
                          - "SNS:DeleteTopic",
                          - "SNS:Subscribe",
                          - "SNS:ListSubscriptionsByTopic",
                          - "SNS:Publish",
                        ]
                      - Condition = {
                          - StringEquals = {
                              - "AWS:SourceOwner" = "307946671795"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "*"
                        }
                      - Resource  = "arn:aws:sns:ap-southeast-3:307946671795:svep-backend-pluginGnomadConstraint"
                      - Sid       = "__default_statement_ID"
                    },
                ]
              - Version   = "2008-10-17"
            }
        ) -> null
      - signature_version                        = 0 -> null
      - sqs_success_feedback_sample_rate         = 0 -> null
      - tags                                     = {} -> null
      - tags_all                                 = {} -> null
        # (18 unchanged attributes hidden)
    }

  # module.svep[0].aws_sns_topic.pluginGnomadOneKG will be destroyed
  # (because aws_sns_topic.pluginGnomadOneKG is not in configuration)
  - resource "aws_sns_topic" "pluginGnomadOneKG" {
      - application_success_feedback_sample_rate = 0 -> null
      - arn                                      = "arn:aws:sns:ap-southeast-3:307946671795:svep-backend-pluginGnomadOneKG" -> null
      - content_based_deduplication              = false -> null
      - fifo_topic                               = false -> null
      - firehose_success_feedback_sample_rate    = 0 -> null
      - http_success_feedback_sample_rate        = 0 -> null
      - id                                       = "arn:aws:sns:ap-southeast-3:307946671795:svep-backend-pluginGnomadOneKG" -> null
      - lambda_success_feedback_sample_rate      = 0 -> null
      - name                                     = "svep-backend-pluginGnomadOneKG" -> null
      - owner                                    = "307946671795" -> null
      - policy                                   = jsonencode(
            {
              - Id        = "__default_policy_ID"
              - Statement = [
                  - {
                      - Action    = [
                          - "SNS:GetTopicAttributes",
                          - "SNS:SetTopicAttributes",
                          - "SNS:AddPermission",
                          - "SNS:RemovePermission",
                          - "SNS:DeleteTopic",
                          - "SNS:Subscribe",
                          - "SNS:ListSubscriptionsByTopic",
                          - "SNS:Publish",
                        ]
                      - Condition = {
                          - StringEquals = {
                              - "AWS:SourceOwner" = "307946671795"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "*"
                        }
                      - Resource  = "arn:aws:sns:ap-southeast-3:307946671795:svep-backend-pluginGnomadOneKG"
                      - Sid       = "__default_statement_ID"
                    },
                ]
              - Version   = "2008-10-17"
            }
        ) -> null
      - signature_version                        = 0 -> null
      - sqs_success_feedback_sample_rate         = 0 -> null
      - tags                                     = {} -> null
      - tags_all                                 = {} -> null
        # (18 unchanged attributes hidden)
    }

  # module.svep[0].aws_sns_topic_subscription.pluginGnomadConstraint will be destroyed
  # (because aws_sns_topic_subscription.pluginGnomadConstraint is not in configuration)
  - resource "aws_sns_topic_subscription" "pluginGnomadConstraint" {
      - arn                             = "arn:aws:sns:ap-southeast-3:307946671795:svep-backend-pluginGnomadConstraint:8a8ab728-f276-41cb-834f-6d0783d9ef94" -> null
      - confirmation_timeout_in_minutes = 1 -> null
      - confirmation_was_authenticated  = true -> null
      - endpoint                        = "arn:aws:lambda:ap-southeast-3:307946671795:function:svep-backend-pluginGnomadConstraint" -> null
      - endpoint_auto_confirms          = false -> null
      - id                              = "arn:aws:sns:ap-southeast-3:307946671795:svep-backend-pluginGnomadConstraint:8a8ab728-f276-41cb-834f-6d0783d9ef94" -> null
      - owner_id                        = "307946671795" -> null
      - pending_confirmation            = false -> null
      - protocol                        = "lambda" -> null
      - raw_message_delivery            = false -> null
      - topic_arn                       = "arn:aws:sns:ap-southeast-3:307946671795:svep-backend-pluginGnomadConstraint" -> null
        # (6 unchanged attributes hidden)
    }

  # module.svep[0].aws_sns_topic_subscription.pluginGnomadOneKG will be destroyed
  # (because aws_sns_topic_subscription.pluginGnomadOneKG is not in configuration)
  - resource "aws_sns_topic_subscription" "pluginGnomadOneKG" {
      - arn                             = "arn:aws:sns:ap-southeast-3:307946671795:svep-backend-pluginGnomadOneKG:364fa064-857e-423c-aefd-f2190eaab81b" -> null
      - confirmation_timeout_in_minutes = 1 -> null
      - confirmation_was_authenticated  = true -> null
      - endpoint                        = "arn:aws:lambda:ap-southeast-3:307946671795:function:svep-backend-pluginGnomadOneKG" -> null
      - endpoint_auto_confirms          = false -> null
      - id                              = "arn:aws:sns:ap-southeast-3:307946671795:svep-backend-pluginGnomadOneKG:364fa064-857e-423c-aefd-f2190eaab81b" -> null
      - owner_id                        = "307946671795" -> null
      - pending_confirmation            = false -> null
      - protocol                        = "lambda" -> null
      - raw_message_delivery            = false -> null
      - topic_arn                       = "arn:aws:sns:ap-southeast-3:307946671795:svep-backend-pluginGnomadOneKG" -> null
        # (6 unchanged attributes hidden)
    }

  # module.svep[0].null_resource.init_script must be replaced
+/- resource "null_resource" "init_script" {
      ~ id       = "2519020678279080611" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "script_hash" = "01e727bcc92faebfec86a58bf89ce955a0845b92" -> "6a6009963759ae87469ede88fa3568c232c26e6e"
        }
    }

  # module.webgui.data.external.build will be read during apply
  # (config refers to values not yet known)
 <= data "external" "build" {
      + id          = (known after apply)
      + program     = [
          + "python",
          + "build_and_hash.py",
        ]
      + query       = {
          + "api_endpoint_clinic"     = "https://d2s63ui4631ggd.cloudfront.net/prod/"
          + "api_endpoint_sbeacon"    = "https://d1sqme4qqoevfa.cloudfront.net/prod/"
          + "base_range"              = "5000"
          + "build_command"           = "./node_modules/.bin/ng build --configuration production --subresource-integrity"
          + "build_destiation"        = "../webapp/dist/beacon-v2-ui/browser/"
          + "clinic_mode"             = "svep"
          + "data_portal_bucket"      = (known after apply)
          + "hub_name"                = "RSCM"
          + "identity_pool_id"        = "ap-southeast-3:5ff48e61-9ece-46c3-9628-284b783a62d9"
          + "install_command"         = "pnpm install"
          + "region"                  = "ap-southeast-3"
          + "user_pool_id"            = "ap-southeast-3_1pggQ2ofX"
          + "user_pool_web_client_id" = "h0fgvvsvfu9lvaj4mluffgsfg"
          + "webapp_dir"              = "../webapp/"
        }
      + result      = (known after apply)
      + working_dir = "webgui/terraform-aws"
    }

  # module.webgui.aws_cloudfront_response_headers_policy.bui-security-headers-policy will be updated in-place
  ~ resource "aws_cloudfront_response_headers_policy" "bui-security-headers-policy" {
        id      = "be0a849f-51d7-4ddf-92cd-abc8d8b4dc03"
        name    = "bui-security-headers-policy"
        # (3 unchanged attributes hidden)

      ~ security_headers_config {
          ~ content_security_policy {
              ~ content_security_policy = "default-src 'none'; script-src 'self' 'sha256-2P8mXF+NOGY5a6oJ1jDjLINrckn9RgJYdEesn+Qf4rQ=' https://cdn.jsdelivr.net/npm/igv@3.1.2/dist/igv.min.js; style-src 'self' 'unsafe-inline'; font-src 'self' https://fonts.gstatic.com; img-src 'self' data: content: blob: https://gaspi-dataportal-20250110044710445000000002.s3.ap-southeast-3.amazonaws.com; form-action 'self'; connect-src 'self' https://d1sqme4qqoevfa.cloudfront.net/prod/ https://d2s63ui4631ggd.cloudfront.net/prod/ https://cognito-identity.ap-southeast-3.amazonaws.com https://cognito-idp.ap-southeast-3.amazonaws.com https://gaspi-dataportal-20250110044710445000000002.s3.ap-southeast-3.amazonaws.com https://api.pricing.us-east-1.amazonaws.com https://igv.org/genomes/ https://hgdownload.soe.ucsc.edu/goldenPath/hg38/ https://eutils.ncbi.nlm.nih.gov/entrez/eutils/; frame-ancestors 'none'; base-uri 'self'; object-src 'none'; manifest-src 'self';" -> (known after apply)
                # (1 unchanged attribute hidden)
            }

            # (5 unchanged blocks hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.webgui.aws_s3_object.version will be destroyed
  # (because aws_s3_object.version is not in configuration)
  - resource "aws_s3_object" "version" {
      - arn                           = "arn:aws:s3:::webgui-bucket-20241204060930481800000001/version.txt" -> null
      - bucket                        = "webgui-bucket-20241204060930481800000001" -> null
      - bucket_key_enabled            = false -> null
      - content                       = "v0.11.0-alpha-2-ga0f191f+" -> null
      - content_type                  = "application/octet-stream" -> null
      - etag                          = "d762f028c3272e3ccdb9dbb9a147d93c" -> null
      - force_destroy                 = false -> null
      - id                            = "version.txt" -> null
      - key                           = "version.txt" -> null
      - server_side_encryption        = "AES256" -> null
      - storage_class                 = "STANDARD" -> null
      - tags_all                      = {
          - "Environment" = "dev"
          - "NAME"        = "portal-frontend"
          - "Owner"       = "gaspi"
        } -> null
        # (14 unchanged attributes hidden)
    }

  # module.webgui.null_resource.cloudfront-invalidate must be replaced
-/+ resource "null_resource" "cloudfront-invalidate" {
      ~ id       = "1562815731" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "compiled_code_hash" = "933cf5a10e41b62d3398625df6fabde7896dcca1" -> (known after apply)
        }
    }

  # module.webgui.null_resource.s3-upload must be replaced
-/+ resource "null_resource" "s3-upload" {
      ~ id       = "304596660" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "compiled_code_hash" = "933cf5a10e41b62d3398625df6fabde7896dcca1" -> (known after apply)
            # (1 unchanged element hidden)
        }
    }

  # module.webgui.terraform_data.cloudfront-version-invalidate will be destroyed
  # (because terraform_data.cloudfront-version-invalidate is not in configuration)
  - resource "terraform_data" "cloudfront-version-invalidate" {
      - id               = "8b5d09b7-0c3b-4f00-15b0-5542e41e7a52" -> null
      - triggers_replace = [
          - "v0.11.0-alpha-2-ga0f191f+",
        ] -> null
    }

  # module.cognito.module.lambda-customMessageLambdaTrigger.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "1116528107" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1738902407886527000" -> "1749455686449146000"
            # (1 unchanged element hidden)
        }
    }

  # module.cognito.module.lambda-logEmailDelivery.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "283177635" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1739950388698911000" -> "1749455686069176000"
            # (1 unchanged element hidden)
        }
    }

  # module.cognito.module.lambda-sendRegistrationEmail.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "1035380056" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1748396982762038000" -> "1749455685446942000"
            # (1 unchanged element hidden)
        }
    }

  # module.cognito.module.lambda-sendSvepJobEmail.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "56735927" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1748396983447726000" -> "1749455686620261000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.docker_image_submitDataset_lambda.docker_image.this must be replaced
+/- resource "docker_image" "this" {
      ~ id           = "sha256:3c2dbd2ec04d5c0fbc23a7f0d20df2756c5b08f93c387f345e3bb582c6633219307946671795.dkr.ecr.ap-southeast-3.amazonaws.com/sbeacon-submitdataset-lambda-containers" -> (known after apply)
      ~ image_id     = "sha256:3c2dbd2ec04d5c0fbc23a7f0d20df2756c5b08f93c387f345e3bb582c6633219" -> (known after apply)
        name         = "307946671795.dkr.ecr.ap-southeast-3.amazonaws.com/sbeacon-submitdataset-lambda-containers"
      + repo_digest  = (known after apply)
      ~ triggers     = { # forces replacement
          ~ "dir_sha" = "de67864eea5d0909122b794e360457f2bbb22e5b" -> "af426ac43ae2c0adaf51729f9b867567679cb470"
        }
        # (2 unchanged attributes hidden)

      - build {
          - build_args      = {
              - "SHARED_LAYER_PATH" = "sbeacon/shared_resources/python-modules/python/shared"
            } -> null
          - cache_from      = [] -> null
          - context         = "sbeacon/lambda/submitDataset" -> null
          - cpu_period      = 0 -> null
          - cpu_quota       = 0 -> null
          - cpu_shares      = 0 -> null
          - dockerfile      = "Dockerfile" -> null
          - extra_hosts     = [] -> null
          - force_remove    = false -> null
          - label           = {} -> null
          - labels          = {} -> null
          - memory          = 0 -> null
          - memory_swap     = 0 -> null
          - no_cache        = false -> null
          - platform        = "linux/amd64" -> null
          - pull_parent     = false -> null
          - remove          = true -> null
          - security_opt    = [] -> null
          - shm_size        = 0 -> null
          - squash          = false -> null
          - suppress_output = false -> null
          - tag             = [] -> null
            # (12 unchanged attributes hidden)
        }
      + build {
          + build_args     = {
              + "SHARED_LAYER_PATH" = "sbeacon/shared_resources/python-modules/python/shared"
            }
          + cache_from     = []
          + context        = "sbeacon/lambda/submitDataset"
          + dockerfile     = "Dockerfile"
          + extra_hosts    = []
          + platform       = "linux/amd64"
          + remove         = true
          + security_opt   = []
          + tag            = []
            # (12 unchanged attributes hidden)
        }
    }

  # module.sbeacon.module.docker_image_submitDataset_lambda.docker_registry_image.this must be replaced
+/- resource "docker_registry_image" "this" {
      ~ id                   = "sha256:5f26b15fc5a8abe733dde459c0ebbfc04dbed69bd3e2daf2b7184a799f9a6afe" -> (known after apply)
        name                 = "307946671795.dkr.ecr.ap-southeast-3.amazonaws.com/sbeacon-submitdataset-lambda-containers"
      ~ sha256_digest        = "sha256:5f26b15fc5a8abe733dde459c0ebbfc04dbed69bd3e2daf2b7184a799f9a6afe" -> (known after apply)
      ~ triggers             = { # forces replacement
          ~ "dir_sha" = "de67864eea5d0909122b794e360457f2bbb22e5b" -> "af426ac43ae2c0adaf51729f9b867567679cb470"
        }
        # (2 unchanged attributes hidden)
    }

  # module.sbeacon.module.lambda-admin.aws_iam_role_policy.additional_jsons[0] will be updated in-place
  ~ resource "aws_iam_role_policy" "additional_jsons" {
        id          = "sbeacon-backend-admin:sbeacon-backend-admin-0"
        name        = "sbeacon-backend-admin-0"
      ~ policy      = jsonencode(
          ~ {
              ~ Statement = [
                    # (1 unchanged element hidden)
                    {
                        Action   = [
                            "dynamodb:Scan",
                            "dynamodb:Query",
                            "dynamodb:GetItem",
                            "dynamodb:BatchGetItem",
                        ]
                        Effect   = "Allow"
                        Resource = "arn:aws:dynamodb:ap-southeast-3:307946671795:table/sbeacon-dataportal-users-quota"
                    },
                  - {
                      - Action   = [
                          - "dynamodb:Scan",
                          - "dynamodb:Query",
                          - "dynamodb:GetItem",
                          - "dynamodb:DeleteItem",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:dynamodb:ap-southeast-3:307946671795:table/sbeacon-dataportal-juptyer-notebooks"
                    },
                  - {
                      - Action   = [
                          - "sagemaker:StopNotebookInstance",
                          - "sagemaker:DescribeNotebookInstance",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:sagemaker:ap-southeast-3:307946671795:notebook-instance/*"
                    },
                    {
                        Action   = "lambda:InvokeFunction"
                        Effect   = "Allow"
                        Resource = "arn:aws:lambda:ap-southeast-3:307946671795:function:cognito-sendRegistrationEmail"
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        # (2 unchanged attributes hidden)
    }

  # module.sbeacon.module.lambda-admin.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/246d4ee44e05c606e10757f9cc51e6ef3c92b96947f5ecea94a36d6eefd6d98e.zip" -> "builds/e3cc12796b0e73597205038af877b72afc008256556d20072be67f51507f8e2f.zip"
        id                             = "sbeacon-backend-admin"
      ~ last_modified                  = "2025-06-05T06:21:13.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_libraries_layer:49",
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_modules_layer:24",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (25 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "DYNAMO_JUPYTER_INSTANCES_TABLE"       = "sbeacon-dataportal-juptyer-notebooks" -> null
                # (35 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-admin.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "sbeacon/lambda/admin",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/e3cc12796b0e73597205038af877b72afc008256556d20072be67f51507f8e2f.zip"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/e3cc12796b0e73597205038af877b72afc008256556d20072be67f51507f8e2f.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.lambda-admin.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "582767546" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/246d4ee44e05c606e10757f9cc51e6ef3c92b96947f5ecea94a36d6eefd6d98e.zip" -> "builds/e3cc12796b0e73597205038af877b72afc008256556d20072be67f51507f8e2f.zip"
          ~ "timestamp" = "1749021468003907000" -> "1749455686065551000"
        }
    }

  # module.sbeacon.module.lambda-data-portal.aws_iam_role_policy.additional_jsons[0] will be updated in-place
  ~ resource "aws_iam_role_policy" "additional_jsons" {
        id          = "sbeacon-backend-dataPortal:sbeacon-backend-dataPortal-0"
        name        = "sbeacon-backend-dataPortal-0"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "dynamodb:UpdateItem",
                          - "dynamodb:Scan",
                          - "dynamodb:Query",
                          - "dynamodb:PutItem",
                          - "dynamodb:GetItem",
                          - "dynamodb:DescribeTable",
                          - "dynamodb:DeleteItem",
                          - "dynamodb:BatchWriteItem",
                          - "dynamodb:BatchGetItem",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:dynamodb:ap-southeast-3:307946671795:table/sbeacon-dataportal-users-quota",
                          - "arn:aws:dynamodb:ap-southeast-3:307946671795:table/sbeacon-dataportal-saved-queries",
                          - "arn:aws:dynamodb:ap-southeast-3:307946671795:table/sbeacon-dataportal-projects",
                          - "arn:aws:dynamodb:ap-southeast-3:307946671795:table/sbeacon-dataportal-project-users",
                          - "arn:aws:dynamodb:ap-southeast-3:307946671795:table/sbeacon-dataportal-pricing-cache",
                          - "arn:aws:dynamodb:ap-southeast-3:307946671795:table/sbeacon-dataportal-juptyer-notebooks",
                          - "arn:aws:dynamodb:ap-southeast-3:307946671795:table/sbeacon-dataportal-clinical-variants",
                          - "arn:aws:dynamodb:ap-southeast-3:307946671795:table/sbeacon-dataportal-clinical-annotations",
                          - "arn:aws:dynamodb:ap-southeast-3:307946671795:table/sbeacon-dataportal-clinic-jobs",
                        ]
                    },
                  - {
                      - Action   = "pricing:*"
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = "dynamodb:Query"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:dynamodb:ap-southeast-3:307946671795:table/sbeacon-dataportal-project-users/index/uid-index",
                          - "arn:aws:dynamodb:ap-southeast-3:307946671795:table/sbeacon-dataportal-clinic-jobs/index/project-name-index",
                        ]
                    },
                  - {
                      - Action   = "cognito-idp:ListUsers"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:cognito-idp:ap-southeast-3:307946671795:userpool/ap-southeast-3_1pggQ2ofX"
                    },
                  - {
                      - Action   = [
                          - "sagemaker:UpdateNotebookInstance",
                          - "sagemaker:StopNotebookInstance",
                          - "sagemaker:StartNotebookInstance",
                          - "sagemaker:ListNotebookInstances",
                          - "sagemaker:DescribeNotebookInstance",
                          - "sagemaker:DeleteNotebookInstance",
                          - "sagemaker:CreatePresignedNotebookInstanceUrl",
                          - "sagemaker:CreateNotebookInstance",
                          - "sagemaker:AddTags",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:sagemaker:ap-southeast-3:307946671795:notebook-instance/*"
                    },
                  - {
                      - Action   = "sagemaker:ListNotebookInstances"
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = "iam:PassRole"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:iam::307946671795:role/sbeacon_backend_sagemaker_jupyter_instance_role"
                    },
                  - {
                      - Action    = "s3:ListBucket"
                      - Condition = {
                          - StringLike = {
                              - "s3:prefix" = [
                                  - "projects/*",
                                  - "private/*",
                                ]
                            }
                        }
                      - Effect    = "Allow"
                      - Resource  = "arn:aws:s3:::gaspi-dataportal-20250110044710445000000002"
                    },
                  - {
                      - Action   = "s3:ListBucket"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::svep-backend-temp-20241204060929941500000004"
                    },
                  - {
                      - Action   = "s3:DeleteObject"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::svep-backend-temp-20241204060929941500000004/*"
                    },
                  - {
                      - Action   = [
                          - "s3:GetObject",
                          - "s3:DeleteObject",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::gaspi-metadata-20250110044708770100000001/*",
                          - "arn:aws:s3:::gaspi-dataportal-20250110044710445000000002/projects/*",
                        ]
                    },
                  - {
                      - Action   = "s3:DeleteObject"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::gaspi-dataportal-20250110044710445000000002/private/*"
                    },
                  - {
                      - Action   = "s3:ListBucket"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::svep-backend-temp-20241204060929941500000004",
                          - "arn:aws:s3:::svep-backend-regions-20241204060928215800000001",
                        ]
                    },
                  - {
                      - Action   = "s3:DeleteObject"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::svep-backend-temp-20241204060929941500000004/*",
                          - "arn:aws:s3:::svep-backend-regions-20241204060928215800000001/*",
                        ]
                    },
                  - {
                      - Action   = "lambda:InvokeFunction"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:lambda:ap-southeast-3:307946671795:function:sbeacon-backend-submitDataset",
                          - "arn:aws:lambda:ap-southeast-3:307946671795:function:sbeacon-backend-indexer",
                          - "arn:aws:lambda:ap-southeast-3:307946671795:function:sbeacon-backend-generateReports",
                          - "arn:aws:lambda:ap-southeast-3:307946671795:function:sbeacon-backend-generateCohortVCfs",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.sbeacon.module.lambda-data-portal.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/aecbe134665ea7033e10753a36666774d200664bd0d4ac282c8db10e4297f290.zip" -> "builds/4b8981152d7b14a64376cd5830a8e4e4e3bf673ab2285e463b5d8c44c9050860.zip"
        id                             = "sbeacon-backend-dataPortal"
      ~ last_modified                  = "2025-06-05T06:21:43.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_libraries_layer:49",
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_modules_layer:24",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (25 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "ATHENA_METADATA_BUCKET"               = "gaspi-metadata-20250110044708770100000001"
              - "BEACON_ALTERNATIVE_URL"               = "https://bioinformatics.csiro.au/"
              - "BEACON_API_VERSION"                   = "v2.0.0"
              - "BEACON_CREATE_DATETIME"               = "2018-11-26H00:00:00Z"
              - "BEACON_DEFAULT_GRANULARITY"           = "boolean"
              - "BEACON_DESCRIPTION"                   = "Serverless Beacon (sBeacon)"
              - "BEACON_DOCUMENTATION_URL"             = "https://github.com/EGA-archive/beacon2-ri-api"
              - "BEACON_ENVIRONMENT"                   = "dev"
              - "BEACON_HANDOVERS"                     = jsonencode([])
              - "BEACON_ID"                            = "au.csiro.sbeacon"
              - "BEACON_NAME"                          = "CSIRO Serverless Beacon"
              - "BEACON_ORG_ADDRESS"                   = "AEHRC, Westmead NSW, Australia"
              - "BEACON_ORG_CONTACT_URL"               = "https://bioinformatics.csiro.au/get-in-touch/"
              - "BEACON_ORG_DESCRIPTION"               = "CSIRO, Australia"
              - "BEACON_ORG_ID"                        = "CSIRO"
              - "BEACON_ORG_LOGO_URL"                  = "https://raw.githubusercontent.com/aehrc/terraform-aws-serverless-beacon/master/assets/logo-tile.png"
              - "BEACON_ORG_NAME"                      = "CSIRO"
              - "BEACON_ORG_WELCOME_URL"               = "https://bioinformatics.csiro.au/"
              - "BEACON_SERVICE_TYPE_ARTIFACT"         = "beacon"
              - "BEACON_SERVICE_TYPE_GROUP"            = "au.csiro"
              - "BEACON_SERVICE_TYPE_VERSION"          = "1.0"
              - "BEACON_UPDATE_DATETIME"               = "2023-03-16H00:00:00Z"
              - "BEACON_URI"                           = "https://beacon.csiro.au"
              - "BEACON_VERSION"                       = "v0.1.0"
              - "BEACON_WELCOME_URL"                   = "https://bioinformatics.csiro.au/"
              - "CLINIC_REGION_NAME"                   = "svep-backend-regions-20241204060928215800000001"
              - "CLINIC_TEMP_NAME"                     = "svep-backend-temp-20241204060929941500000004"
              - "COGNITO_ADMIN_GROUP_NAME"             = "administrators"
              - "COGNITO_MANAGER_GROUP_NAME"           = "managers"
              - "COHORT_MAKER_LAMBDA"                  = "sbeacon-backend-generateCohortVCfs"
              - "CONFIG_MAX_VARIANT_SEARCH_BASE_RANGE" = "5000"
              - "DPORTAL_BUCKET"                       = "gaspi-dataportal-20250110044710445000000002"
              - "DYNAMO_ANSCESTORS_TABLE"              = "sbeacon-Anscestors"
              - "DYNAMO_CLINICAL_ANNOTATIONS_TABLE"    = "sbeacon-dataportal-clinical-annotations"
              - "DYNAMO_CLINICAL_VARIANTS_TABLE"       = "sbeacon-dataportal-clinical-variants"
              - "DYNAMO_CLINIC_JOBS_TABLE"             = "sbeacon-dataportal-clinic-jobs"
              - "DYNAMO_DATAPORTAL_LOCKS_TABLE"        = "sbeacon-dataportal-mutex-locks"
              - "DYNAMO_DESCENDANTS_TABLE"             = "sbeacon-Descendants"
              - "DYNAMO_JUPYTER_INSTANCES_TABLE"       = "sbeacon-dataportal-juptyer-notebooks"
              - "DYNAMO_ONTOLOGIES_TABLE"              = "sbeacon-Ontologies"
              - "DYNAMO_PRICING_CACHE_TABLE"           = "sbeacon-dataportal-pricing-cache"
              - "DYNAMO_PROJECTS_TABLE"                = "sbeacon-dataportal-projects"
              - "DYNAMO_PROJECT_USERS_TABLE"           = "sbeacon-dataportal-project-users"
              - "DYNAMO_PROJECT_USERS_UID_INDEX"       = "uid-index"
              - "DYNAMO_QUOTA_USER_TABLE"              = "sbeacon-dataportal-users-quota"
              - "DYNAMO_SAVED_QUERIES_TABLE"           = "sbeacon-dataportal-saved-queries"
              - "HUB_NAME"                             = "RSCM"
              - "INDEXER_LAMBDA"                       = "sbeacon-backend-indexer"
              - "JUPYTER_INSTACE_ROLE_ARN"             = "arn:aws:iam::307946671795:role/sbeacon_backend_sagemaker_jupyter_instance_role"
              - "JUPYTER_LIFECYCLE_CONFIG_NAME"        = "clone-gaspi-notebooks"
              - "REPORTS_LAMBDA"                       = "sbeacon-backend-generateReports"
              - "SUBMIT_LAMBDA"                        = "sbeacon-backend-submitDataset"
              - "USER_POOL_ID"                         = "ap-southeast-3_1pggQ2ofX"
            } -> (known after apply)
        }

        # (3 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-data-portal.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "pip",
                          + "python3.12",
                          + "sbeacon/lambda/dataPortal/requirements.txt",
                          + null,
                          + null,
                        ],
                      + [
                          + "zip",
                          + "sbeacon/lambda/dataPortal",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/4b8981152d7b14a64376cd5830a8e4e4e3bf673ab2285e463b5d8c44c9050860.zip"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/4b8981152d7b14a64376cd5830a8e4e4e3bf673ab2285e463b5d8c44c9050860.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.lambda-data-portal.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "987473582" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/aecbe134665ea7033e10753a36666774d200664bd0d4ac282c8db10e4297f290.zip" -> "builds/4b8981152d7b14a64376cd5830a8e4e4e3bf673ab2285e463b5d8c44c9050860.zip"
          ~ "timestamp" = "1749104300010334000" -> "1749455686548031000"
        }
    }

  # module.sbeacon.module.lambda-deidentifyFiles.aws_iam_role_policy.additional_json[0] will be updated in-place
  ~ resource "aws_iam_role_policy" "additional_json" {
        id          = "sbeacon-backend-deidentifyFiles:sbeacon-backend-deidentifyFiles"
        name        = "sbeacon-backend-deidentifyFiles"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "s3:ListBucket"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::gaspi-dataportal-20250110044710445000000002"
                    },
                  - {
                      - Action   = [
                          - "s3:HeadObject",
                          - "s3:GetObject",
                          - "s3:DeleteObject",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::gaspi-dataportal-20250110044710445000000002/staging/projects/*/project-files/*"
                    },
                  - {
                      - Action   = "s3:PutObject"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::gaspi-dataportal-20250110044710445000000002/projects/*/project-files/*"
                    },
                  - {
                      - Action   = "dynamodb:UpdateItem"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:dynamodb:ap-southeast-3:307946671795:table/sbeacon-vcfs",
                          - "arn:aws:dynamodb:ap-southeast-3:307946671795:table/sbeacon-dataportal-projects",
                        ]
                    },
                  - {
                      - Action   = [
                          - "ec2:RunInstances",
                          - "ec2:DescribeInstances",
                          - "ec2:DescribeImages",
                          - "ec2:CreateTags",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = "iam:PassRole"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:iam::307946671795:role/sbeacon_backend_ec2_deidentification_instance_role"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.sbeacon.module.lambda-deidentifyFiles.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/672ae45c60f0461434bc17038314858de743dca5f8d958239db8ac1f979f96eb.zip" -> "builds/4a5a820f7ea199227e5039a12018bef729e80194bc11a09402dd97a2c12342bb.zip"
        id                             = "sbeacon-backend-deidentifyFiles"
      ~ last_modified                  = "2025-06-05T06:21:07.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_libraries_layer:49",
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_modules_layer:24",
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_binaries_layer:46",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (25 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "DPORTAL_BUCKET"           = "gaspi-dataportal-20250110044710445000000002"
              - "DYNAMO_PROJECTS_TABLE"    = "sbeacon-dataportal-projects"
              - "DYNAMO_VCFS_TABLE"        = "sbeacon-vcfs"
              - "EC2_IAM_INSTANCE_PROFILE" = "sbeacon_backend_ec2_deidentification_instance_profile"
              - "HTS_S3_HOST"              = "s3.ap-southeast-3.amazonaws.com"
            } -> (known after apply)
        }

        # (3 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-deidentifyFiles.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "sbeacon/lambda/deidentifyFiles",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/4a5a820f7ea199227e5039a12018bef729e80194bc11a09402dd97a2c12342bb.zip"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/4a5a820f7ea199227e5039a12018bef729e80194bc11a09402dd97a2c12342bb.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.lambda-deidentifyFiles.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "1460682001" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/672ae45c60f0461434bc17038314858de743dca5f8d958239db8ac1f979f96eb.zip" -> "builds/4a5a820f7ea199227e5039a12018bef729e80194bc11a09402dd97a2c12342bb.zip"
          ~ "timestamp" = "1749021467282111000" -> "1749455686773338000"
        }
    }

  # module.sbeacon.module.lambda-generateCohortVCfs.aws_iam_role_policy.additional_jsons[1] will be updated in-place
  ~ resource "aws_iam_role_policy" "additional_jsons" {
        id          = "sbeacon-backend-generateCohortVCfs:sbeacon-backend-generateCohortVCfs-1"
        name        = "sbeacon-backend-generateCohortVCfs-1"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "athena:StartQueryExecution",
                          - "athena:GetQueryResults",
                          - "athena:GetQueryExecution",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:athena:ap-southeast-3:307946671795:workgroup/query_workgroup"
                    },
                  - {
                      - Action   = "glue:*"
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = "s3:*"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::gaspi-metadata-20250110044708770100000001/*",
                          - "arn:aws:s3:::gaspi-metadata-20250110044708770100000001",
                        ]
                    },
                  - {
                      - Action   = "dynamodb:Query"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:dynamodb:ap-southeast-3:307946671795:table/sbeacon-dataportal-project-users/index/uid-index"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.sbeacon.module.lambda-generateCohortVCfs.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-generateCohortVCfs"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_libraries_layer:49",
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_modules_layer:24",
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_binaries_layer:46",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "ATHENA_ANALYSES_CACHE_TABLE"          = "sbeacon_analyses_cache"
              - "ATHENA_ANALYSES_TABLE"                = "sbeacon_analyses"
              - "ATHENA_BIOSAMPLES_CACHE_TABLE"        = "sbeacon_biosamples_cache"
              - "ATHENA_BIOSAMPLES_TABLE"              = "sbeacon_biosamples"
              - "ATHENA_DATASETS_CACHE_TABLE"          = "sbeacon_datasets_cache"
              - "ATHENA_DATASETS_TABLE"                = "sbeacon_datasets"
              - "ATHENA_INDIVIDUALS_CACHE_TABLE"       = "sbeacon_individuals_cache"
              - "ATHENA_INDIVIDUALS_TABLE"             = "sbeacon_individuals"
              - "ATHENA_METADATA_BUCKET"               = "gaspi-metadata-20250110044708770100000001"
              - "ATHENA_METADATA_DATABASE"             = "sbeacon_metadata"
              - "ATHENA_RELATIONS_TABLE"               = "sbeacon_relations"
              - "ATHENA_RUNS_CACHE_TABLE"              = "sbeacon_runs_cache"
              - "ATHENA_RUNS_TABLE"                    = "sbeacon_runs"
              - "ATHENA_TERMS_CACHE_TABLE"             = "sbeacon_terms_cache"
              - "ATHENA_TERMS_INDEX_TABLE"             = "sbeacon_terms_index"
              - "ATHENA_TERMS_TABLE"                   = "sbeacon_terms"
              - "ATHENA_WORKGROUP"                     = "query_workgroup"
              - "BEACON_ALTERNATIVE_URL"               = "https://bioinformatics.csiro.au/"
              - "BEACON_API_VERSION"                   = "v2.0.0"
              - "BEACON_CREATE_DATETIME"               = "2018-11-26H00:00:00Z"
              - "BEACON_DEFAULT_GRANULARITY"           = "boolean"
              - "BEACON_DESCRIPTION"                   = "Serverless Beacon (sBeacon)"
              - "BEACON_DOCUMENTATION_URL"             = "https://github.com/EGA-archive/beacon2-ri-api"
              - "BEACON_ENVIRONMENT"                   = "dev"
              - "BEACON_HANDOVERS"                     = jsonencode([])
              - "BEACON_ID"                            = "au.csiro.sbeacon"
              - "BEACON_NAME"                          = "CSIRO Serverless Beacon"
              - "BEACON_ORG_ADDRESS"                   = "AEHRC, Westmead NSW, Australia"
              - "BEACON_ORG_CONTACT_URL"               = "https://bioinformatics.csiro.au/get-in-touch/"
              - "BEACON_ORG_DESCRIPTION"               = "CSIRO, Australia"
              - "BEACON_ORG_ID"                        = "CSIRO"
              - "BEACON_ORG_LOGO_URL"                  = "https://raw.githubusercontent.com/aehrc/terraform-aws-serverless-beacon/master/assets/logo-tile.png"
              - "BEACON_ORG_NAME"                      = "CSIRO"
              - "BEACON_ORG_WELCOME_URL"               = "https://bioinformatics.csiro.au/"
              - "BEACON_SERVICE_TYPE_ARTIFACT"         = "beacon"
              - "BEACON_SERVICE_TYPE_GROUP"            = "au.csiro"
              - "BEACON_SERVICE_TYPE_VERSION"          = "1.0"
              - "BEACON_UPDATE_DATETIME"               = "2023-03-16H00:00:00Z"
              - "BEACON_URI"                           = "https://beacon.csiro.au"
              - "BEACON_VERSION"                       = "v0.1.0"
              - "BEACON_WELCOME_URL"                   = "https://bioinformatics.csiro.au/"
              - "COGNITO_USER_POOL_ID"                 = "ap-southeast-3_1pggQ2ofX"
              - "CONFIG_MAX_VARIANT_SEARCH_BASE_RANGE" = "5000"
              - "DPORTAL_BUCKET"                       = "gaspi-dataportal-20250110044710445000000002"
              - "DYNAMO_ANSCESTORS_TABLE"              = "sbeacon-Anscestors"
              - "DYNAMO_DATAPORTAL_LOCKS_TABLE"        = "sbeacon-dataportal-mutex-locks"
              - "DYNAMO_DESCENDANTS_TABLE"             = "sbeacon-Descendants"
              - "DYNAMO_JUPYTER_INSTANCES_TABLE"       = "sbeacon-dataportal-juptyer-notebooks"
              - "DYNAMO_ONTOLOGIES_TABLE"              = "sbeacon-Ontologies"
              - "DYNAMO_PROJECT_USERS_TABLE"           = "sbeacon-dataportal-project-users"
              - "DYNAMO_PROJECT_USERS_UID_INDEX"       = "uid-index"
              - "DYNAMO_QUOTA_USER_TABLE"              = "sbeacon-dataportal-users-quota"
              - "HTS_S3_HOST"                          = "s3.ap-southeast-3.amazonaws.com"
            } -> (known after apply)
        }

        # (3 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-generateCohortVCfs.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "136773845" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1745822211927162000" -> "1749455685746835000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-generateReports.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/b0ee512930a57c0348cc31d03ac17ee7b9f7f73c512bfcd230f43b62ead552c4.zip" -> "builds/f9d680c7bb387bbd50bff6679d94937884c9015652b2ddb14256e1caf43f3456.zip"
        id                             = "sbeacon-backend-generateReports"
      ~ last_modified                  = "2025-06-05T06:21:21.000+0000" -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (26 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-generateReports.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "pip",
                          + "python3.12",
                          + "sbeacon/lambda/generateReports/requirements.txt",
                          + null,
                          + null,
                        ],
                      + [
                          + "zip",
                          + "sbeacon/lambda/generateReports",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/f9d680c7bb387bbd50bff6679d94937884c9015652b2ddb14256e1caf43f3456.zip"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/f9d680c7bb387bbd50bff6679d94937884c9015652b2ddb14256e1caf43f3456.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.lambda-generateReports.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "713988211" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/b0ee512930a57c0348cc31d03ac17ee7b9f7f73c512bfcd230f43b62ead552c4.zip" -> "builds/f9d680c7bb387bbd50bff6679d94937884c9015652b2ddb14256e1caf43f3456.zip"
          ~ "timestamp" = "1749104298430078000" -> "1749455684928356800"
        }
    }

  # module.sbeacon.module.lambda-getAnalyses.aws_iam_role_policy.additional_jsons[1] will be updated in-place
  ~ resource "aws_iam_role_policy" "additional_jsons" {
        id          = "sbeacon-backend-getAnalyses:sbeacon-backend-getAnalyses-1"
        name        = "sbeacon-backend-getAnalyses-1"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "athena:StartQueryExecution",
                          - "athena:GetQueryResults",
                          - "athena:GetQueryExecution",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:athena:ap-southeast-3:307946671795:workgroup/query_workgroup"
                    },
                  - {
                      - Action   = "glue:*"
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = "s3:*"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::gaspi-metadata-20250110044708770100000001/*",
                          - "arn:aws:s3:::gaspi-metadata-20250110044708770100000001",
                        ]
                    },
                  - {
                      - Action   = "dynamodb:Query"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:dynamodb:ap-southeast-3:307946671795:table/sbeacon-dataportal-project-users/index/uid-index"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.sbeacon.module.lambda-getAnalyses.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getAnalyses"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_libraries_layer:49",
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_modules_layer:24",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "ATHENA_ANALYSES_CACHE_TABLE"          = "sbeacon_analyses_cache"
              - "ATHENA_ANALYSES_TABLE"                = "sbeacon_analyses"
              - "ATHENA_BIOSAMPLES_CACHE_TABLE"        = "sbeacon_biosamples_cache"
              - "ATHENA_BIOSAMPLES_TABLE"              = "sbeacon_biosamples"
              - "ATHENA_DATASETS_CACHE_TABLE"          = "sbeacon_datasets_cache"
              - "ATHENA_DATASETS_TABLE"                = "sbeacon_datasets"
              - "ATHENA_INDIVIDUALS_CACHE_TABLE"       = "sbeacon_individuals_cache"
              - "ATHENA_INDIVIDUALS_TABLE"             = "sbeacon_individuals"
              - "ATHENA_METADATA_BUCKET"               = "gaspi-metadata-20250110044708770100000001"
              - "ATHENA_METADATA_DATABASE"             = "sbeacon_metadata"
              - "ATHENA_RELATIONS_TABLE"               = "sbeacon_relations"
              - "ATHENA_RUNS_CACHE_TABLE"              = "sbeacon_runs_cache"
              - "ATHENA_RUNS_TABLE"                    = "sbeacon_runs"
              - "ATHENA_TERMS_CACHE_TABLE"             = "sbeacon_terms_cache"
              - "ATHENA_TERMS_INDEX_TABLE"             = "sbeacon_terms_index"
              - "ATHENA_TERMS_TABLE"                   = "sbeacon_terms"
              - "ATHENA_WORKGROUP"                     = "query_workgroup"
              - "BEACON_ALTERNATIVE_URL"               = "https://bioinformatics.csiro.au/"
              - "BEACON_API_VERSION"                   = "v2.0.0"
              - "BEACON_CREATE_DATETIME"               = "2018-11-26H00:00:00Z"
              - "BEACON_DEFAULT_GRANULARITY"           = "boolean"
              - "BEACON_DESCRIPTION"                   = "Serverless Beacon (sBeacon)"
              - "BEACON_DOCUMENTATION_URL"             = "https://github.com/EGA-archive/beacon2-ri-api"
              - "BEACON_ENVIRONMENT"                   = "dev"
              - "BEACON_HANDOVERS"                     = jsonencode([])
              - "BEACON_ID"                            = "au.csiro.sbeacon"
              - "BEACON_NAME"                          = "CSIRO Serverless Beacon"
              - "BEACON_ORG_ADDRESS"                   = "AEHRC, Westmead NSW, Australia"
              - "BEACON_ORG_CONTACT_URL"               = "https://bioinformatics.csiro.au/get-in-touch/"
              - "BEACON_ORG_DESCRIPTION"               = "CSIRO, Australia"
              - "BEACON_ORG_ID"                        = "CSIRO"
              - "BEACON_ORG_LOGO_URL"                  = "https://raw.githubusercontent.com/aehrc/terraform-aws-serverless-beacon/master/assets/logo-tile.png"
              - "BEACON_ORG_NAME"                      = "CSIRO"
              - "BEACON_ORG_WELCOME_URL"               = "https://bioinformatics.csiro.au/"
              - "BEACON_SERVICE_TYPE_ARTIFACT"         = "beacon"
              - "BEACON_SERVICE_TYPE_GROUP"            = "au.csiro"
              - "BEACON_SERVICE_TYPE_VERSION"          = "1.0"
              - "BEACON_UPDATE_DATETIME"               = "2023-03-16H00:00:00Z"
              - "BEACON_URI"                           = "https://beacon.csiro.au"
              - "BEACON_VERSION"                       = "v0.1.0"
              - "BEACON_WELCOME_URL"                   = "https://bioinformatics.csiro.au/"
              - "CONFIG_MAX_VARIANT_SEARCH_BASE_RANGE" = "5000"
              - "DYNAMO_ANSCESTORS_TABLE"              = "sbeacon-Anscestors"
              - "DYNAMO_DATAPORTAL_LOCKS_TABLE"        = "sbeacon-dataportal-mutex-locks"
              - "DYNAMO_DESCENDANTS_TABLE"             = "sbeacon-Descendants"
              - "DYNAMO_JUPYTER_INSTANCES_TABLE"       = "sbeacon-dataportal-juptyer-notebooks"
              - "DYNAMO_ONTOLOGIES_TABLE"              = "sbeacon-Ontologies"
              - "DYNAMO_PROJECT_USERS_TABLE"           = "sbeacon-dataportal-project-users"
              - "DYNAMO_PROJECT_USERS_UID_INDEX"       = "uid-index"
              - "DYNAMO_QUOTA_USER_TABLE"              = "sbeacon-dataportal-users-quota"
              - "SPLIT_QUERY_LAMBDA"                   = "sbeacon-backend-splitQuery"
              - "SPLIT_QUERY_TOPIC_ARN"                = "arn:aws:sns:ap-southeast-3:307946671795:splitQuery"
            } -> (known after apply)
        }

        # (3 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getAnalyses.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "1967085772" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1741916811545070800" -> "1749455685638323000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getBiosamples.aws_iam_role_policy.additional_jsons[1] will be updated in-place
  ~ resource "aws_iam_role_policy" "additional_jsons" {
        id          = "sbeacon-backend-getBiosamples:sbeacon-backend-getBiosamples-1"
        name        = "sbeacon-backend-getBiosamples-1"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "athena:StartQueryExecution",
                          - "athena:GetQueryResults",
                          - "athena:GetQueryExecution",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:athena:ap-southeast-3:307946671795:workgroup/query_workgroup"
                    },
                  - {
                      - Action   = "glue:*"
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = "s3:*"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::gaspi-metadata-20250110044708770100000001/*",
       
```
</details>
<br>

**Warning**: Output length greater than max comment size. Continued in next comment.